src/cf/src/Catalogs/ШаблоныПлановыхТрудозатрат/ШаблоныПлановыхТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПлановыхТрудозатрат</name>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Включен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаПользователя</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДниНедели</name>
    <attributes>
      <name>Повторять</name>
      <type>
        <types>EnumRef.ПовторятьНедель</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРаботы</name>
      <type>
        <types>EnumRef.ТипыРаботПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>Трудозатраты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Enums/ПовторятьНедель/ПовторятьНедель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПовторятьНедель</name>
  <enumValues>
    <name>РазВНеделю</name>
  </enumValues>
  <enumValues>
    <name>РазВДвеНедели</name>
  </enumValues>
  <enumValues>
    <name>ПервуюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ВторуюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ТретьюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ЧетвертуюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ВторуюЧетвертуюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ПервуюТретьюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>КаждыйДень</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ШаблоныПлановыхТрудозатрат/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДниНеделиПовторятьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДниНедели.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Повторять = ПредопределенноеЗначение("Перечисление.ПовторятьНедель.КаждыйДень") Тогда
	
		 ТекущиеДанные.ДеньНедели = ПредопределенноеЗначение("Перечисление.ДниНедели.ПустаяСсылка");
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
